ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405rx.h
/****************  Bit definition for FLASH_CRC_CTRL register  ****************/
#define FLASH_CRC_CTRL_CRC_SN_Pos           (0U)
#define FLASH_CRC_CTRL_CRC_SN_Msk           (0xFFFFU << FLASH_CRC_CTRL_CRC_SN_Pos)  /*!< 0x0000FFFF */
#define FLASH_CRC_CTRL_CRC_SN               FLASH_CRC_CTRL_CRC_SN_Msk               /*!< CRC sector number */
#define FLASH_CRC_CTRL_CRC_STRT_Pos         (16U)
#define FLASH_CRC_CTRL_CRC_STRT_Msk         (0x1U << FLASH_CRC_CTRL_CRC_STRT_Pos)   /*!< 0x00010000 */
#define FLASH_CRC_CTRL_CRC_STRT             FLASH_CRC_CTRL_CRC_STRT_Msk             /*!< CRC start */

/****************  Bit definition for FLASH_CRC_CHKR register  ****************/
#define FLASH_CRC_CHKR_CRC_CHKR_Pos         (0U)                                    /*!< 0xFFFFFFFF */
#define FLASH_CRC_CHKR_CRC_CHKR_Msk         (0xFFFFFFFFU << FLASH_CRC_CHKR_CRC_CHKR_Pos)
#define FLASH_CRC_CHKR_CRC_CHKR             FLASH_CRC_CHKR_CRC_CHKR_Msk             /*!< CRC check result */

/*****************  Bit definition for SLIB_SET_PWD register  *****************/
#define SLIB_SET_PWD_SLIB_PSET_VAL_Pos      (0U)                                    /*!< 0xFFFFFFFF */
#define SLIB_SET_PWD_SLIB_PSET_VAL_Msk      (0xFFFFFFFFU << SLIB_SET_PWD_SLIB_PSET_VAL_Pos)
#define SLIB_SET_PWD_SLIB_PSET_VAL          SLIB_SET_PWD_SLIB_PSET_VAL_Msk          /*!< Security library password setting value */

/****************  Bit definition for SLIB_SET_RANGE register  ****************/
#define SLIB_SET_RANGE_SLIB_SS_SET_Pos      (0U)                                    /*!< 0x000007FF */
#define SLIB_SET_RANGE_SLIB_SS_SET_Msk      (0x7FFU << SLIB_SET_RANGE_SLIB_SS_SET_Pos)
#define SLIB_SET_RANGE_SLIB_SS_SET          SLIB_SET_RANGE_SLIB_SS_SET_Msk          /*!< Security library start sector setting */
#define SLIB_SET_RANGE_SLIB_DSS_SET_Pos     (11U)                                   /*!< 0x003FF800 */
#define SLIB_SET_RANGE_SLIB_DSS_SET_Msk     (0x7FFU << SLIB_SET_RANGE_SLIB_DSS_SET_Pos)
#define SLIB_SET_RANGE_SLIB_DSS_SET         SLIB_SET_RANGE_SLIB_DSS_SET_Msk         /*!< Security library data start sector setting */
#define SLIB_SET_RANGE_SLIB_ES_SET_Pos      (22U)                                   /*!< 0xFFC00000 */
#define SLIB_SET_RANGE_SLIB_ES_SET_Msk      (0x3FFU << SLIB_SET_RANGE_SLIB_ES_SET_Pos)
#define SLIB_SET_RANGE_SLIB_ES_SET          SLIB_SET_RANGE_SLIB_ES_SET_Msk          /*!< Security library end sector setting */

/*****************  Bit definition for EM_SLIB_SET register  ******************/
#define EM_SLIB_SET_EM_SLIB_SET_Pos         (0U)                                    /*!< 0x0000FFFF */
#define EM_SLIB_SET_EM_SLIB_SET_Msk         (0xFFFFU << EM_SLIB_SET_EM_SLIB_SET_Pos)
#define EM_SLIB_SET_EM_SLIB_SET             EM_SLIB_SET_EM_SLIB_SET_Msk             /*!< Extension memory sLib setting */
#define EM_SLIB_SET_EM_SLIB_DSS_SET_Pos     (16U)                                   /*!< 0x00FF0000 */
#define EM_SLIB_SET_EM_SLIB_DSS_SET_Msk     (0xFFU << EM_SLIB_SET_EM_SLIB_DSS_SET_Pos)
#define EM_SLIB_SET_EM_SLIB_DSS_SET         EM_SLIB_SET_EM_SLIB_DSS_SET_Msk         /*!< Extension memory sLib data start sector setting */

/*****************  Bit definition for BTM_MODE_SET register  *****************/
#define BTM_MODE_SET_BTM_MODE_SET_Pos       (0U)                                    /*!< 0x000000FF */
#define BTM_MODE_SET_BTM_MODE_SET_Msk       (0xFFU << BTM_MODE_SET_BTM_MODE_SET_Pos)
#define BTM_MODE_SET_BTM_MODE_SET           BTM_MODE_SET_BTM_MODE_SET_Msk           /*!< Boot memory mode setting */

/*****************  Bit definition for SLIB_UNLOCK register  ******************/
#define SLIB_UNLOCK_SLIB_UKVAL_Pos          (0U)                                    /*!< 0xFFFFFFFF */
#define SLIB_UNLOCK_SLIB_UKVAL_Msk          (0xFFFFFFFFU << SLIB_UNLOCK_SLIB_UKVAL_Pos)
#define SLIB_UNLOCK_SLIB_UKVAL              SLIB_UNLOCK_SLIB_UKVAL_Msk              /*!< Security library unlock key value */

#define SLIB_KEY_Pos                        (0U)
#define SLIB_KEY_Msk                        (0xA35F6D24U << SLIB_KEY_Pos)           /*!< 0xA35F6D24 */
#define SLIB_KEY                            SLIB_KEY_Msk                            /*!< Security library key */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_FAP register  *******************/
#define FLASH_FAP_FAP_Pos                   (0U)
#define FLASH_FAP_FAP_Msk                   (0xFFU << FLASH_FAP_FAP_Pos)            /*!< 0x000000FF */
#define FLASH_FAP_FAP                       FLASH_FAP_FAP_Msk                       /*!< Flash memory access protection */
#define FLASH_FAP_nFAP_Pos                  (8U)
#define FLASH_FAP_nFAP_Msk                  (0xFFU << FLASH_FAP_nFAP_Pos)           /*!< 0x0000FF00 */
#define FLASH_FAP_nFAP                      FLASH_FAP_nFAP_Msk                      /*!< Inverse code of flash memory access protection */

/******************  Bit definition for FLASH_SSB register  *******************/
#define FLASH_SSB_SSB_Pos                   (16U)
#define FLASH_SSB_SSB_Msk                   (0xFFU << FLASH_SSB_SSB_Pos)            /*!< 0x00FF0000 */
#define FLASH_SSB_SSB                       FLASH_SSB_SSB_Msk                       /*!< System configuration byte */
#define FLASH_SSB_nSSB_Pos                  (24U)
#define FLASH_SSB_nSSB_Msk                  (0xFFU << FLASH_SSB_nSSB_Pos)           /*!< 0xFF000000 */
#define FLASH_SSB_nSSB                      FLASH_SSB_nSSB_Msk                      /*!< Inverse code of system configuration byte */

/*****************  Bit definition for FLASH_DATA0 register  ******************/
#define FLASH_DATA0_DATA0_Pos               (0U)
#define FLASH_DATA0_DATA0_Msk               (0xFFU << FLASH_DATA0_DATA0_Pos)        /*!< 0x000000FF */
#define FLASH_DATA0_DATA0                   FLASH_DATA0_DATA0_Msk                   /*!< User data 0 */
#define FLASH_DATA0_nDATA0_Pos              (8U)
#define FLASH_DATA0_nDATA0_Msk              (0xFFU << FLASH_DATA0_nDATA0_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA0_nDATA0                  FLASH_DATA0_nDATA0_Msk                  /*!< Inverse code of user data 0 */

