ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405rx.h
/******************  Bit definition for GPIO_ODRVR register  ******************/
#define GPIO_ODRVR_ODRV_Pos                 (0U)
#define GPIO_ODRVR_ODRV_Msk                 (0xFFFFFFFFU << GPIO_ODRVR_ODRV_Pos)    /*!< 0xFFFFFFFF */
#define GPIO_ODRVR_ODRV                     GPIO_ODRVR_ODRV_Msk                     /*!< GPIO x drive capability */

/*!< ODRV0 configuration */
#define GPIO_ODRVR_ODRV0_Pos                (0U)
#define GPIO_ODRVR_ODRV0_Msk                (0x3U << GPIO_ODRVR_ODRV0_Pos)          /*!< 0x00000003 */
#define GPIO_ODRVR_ODRV0                    GPIO_ODRVR_ODRV0_Msk                    /*!< ODRV0[1:0] bits (GPIO x drive capability, pin 0) */
#define GPIO_ODRVR_ODRV0_0                  (0x1U << GPIO_ODRVR_ODRV0_Pos)          /*!< 0x00000001 */
#define GPIO_ODRVR_ODRV0_1                  (0x2U << GPIO_ODRVR_ODRV0_Pos)          /*!< 0x00000002 */

/*!< ODRV1 configuration */
#define GPIO_ODRVR_ODRV1_Pos                (2U)
#define GPIO_ODRVR_ODRV1_Msk                (0x3U << GPIO_ODRVR_ODRV1_Pos)          /*!< 0x0000000C */
#define GPIO_ODRVR_ODRV1                    GPIO_ODRVR_ODRV1_Msk                    /*!< ODRV1[1:0] bits (GPIO x drive capability, pin 1) */
#define GPIO_ODRVR_ODRV1_0                  (0x1U << GPIO_ODRVR_ODRV1_Pos)          /*!< 0x00000004 */
#define GPIO_ODRVR_ODRV1_1                  (0x2U << GPIO_ODRVR_ODRV1_Pos)          /*!< 0x00000008 */

/*!< ODRV2 configuration */
#define GPIO_ODRVR_ODRV2_Pos                (4U)
#define GPIO_ODRVR_ODRV2_Msk                (0x3U << GPIO_ODRVR_ODRV2_Pos)          /*!< 0x00000030 */
#define GPIO_ODRVR_ODRV2                    GPIO_ODRVR_ODRV2_Msk                    /*!< ODRV2[1:0] bits (GPIO x drive capability, pin 2) */
#define GPIO_ODRVR_ODRV2_0                  (0x1U << GPIO_ODRVR_ODRV2_Pos)          /*!< 0x00000010 */
#define GPIO_ODRVR_ODRV2_1                  (0x2U << GPIO_ODRVR_ODRV2_Pos)          /*!< 0x00000020 */

/*!< ODRV3 configuration */
#define GPIO_ODRVR_ODRV3_Pos                (6U)
#define GPIO_ODRVR_ODRV3_Msk                (0x3U << GPIO_ODRVR_ODRV3_Pos)          /*!< 0x000000C0 */
#define GPIO_ODRVR_ODRV3                    GPIO_ODRVR_ODRV3_Msk                    /*!< ODRV3[1:0] bits (GPIO x drive capability, pin 3) */
#define GPIO_ODRVR_ODRV3_0                  (0x1U << GPIO_ODRVR_ODRV3_Pos)          /*!< 0x00000040 */
#define GPIO_ODRVR_ODRV3_1                  (0x2U << GPIO_ODRVR_ODRV3_Pos)          /*!< 0x00000080 */

/*!< ODRV4 configuration */
#define GPIO_ODRVR_ODRV4_Pos                (8U)
#define GPIO_ODRVR_ODRV4_Msk                (0x3U << GPIO_ODRVR_ODRV4_Pos)          /*!< 0x00000300 */
#define GPIO_ODRVR_ODRV4                    GPIO_ODRVR_ODRV4_Msk                    /*!< ODRV4[1:0] bits (GPIO x drive capability, pin 4) */
#define GPIO_ODRVR_ODRV4_0                  (0x1U << GPIO_ODRVR_ODRV4_Pos)          /*!< 0x00000100 */
#define GPIO_ODRVR_ODRV4_1                  (0x2U << GPIO_ODRVR_ODRV4_Pos)          /*!< 0x00000200 */

/*!< ODRV5 configuration */
#define GPIO_ODRVR_ODRV5_Pos                (10U)
#define GPIO_ODRVR_ODRV5_Msk                (0x3U << GPIO_ODRVR_ODRV5_Pos)          /*!< 0x00000C00 */
#define GPIO_ODRVR_ODRV5                    GPIO_ODRVR_ODRV5_Msk                    /*!< ODRV5[1:0] bits (GPIO x drive capability, pin 5) */
#define GPIO_ODRVR_ODRV5_0                  (0x1U << GPIO_ODRVR_ODRV5_Pos)          /*!< 0x00000400 */
#define GPIO_ODRVR_ODRV5_1                  (0x2U << GPIO_ODRVR_ODRV5_Pos)          /*!< 0x00000800 */

/*!< ODRV6 configuration */
#define GPIO_ODRVR_ODRV6_Pos                (12U)
#define GPIO_ODRVR_ODRV6_Msk                (0x3U << GPIO_ODRVR_ODRV6_Pos)          /*!< 0x00003000 */
#define GPIO_ODRVR_ODRV6                    GPIO_ODRVR_ODRV6_Msk                    /*!< ODRV6[1:0] bits (GPIO x drive capability, pin 6) */
#define GPIO_ODRVR_ODRV6_0                  (0x1U << GPIO_ODRVR_ODRV6_Pos)          /*!< 0x00001000 */
#define GPIO_ODRVR_ODRV6_1                  (0x2U << GPIO_ODRVR_ODRV6_Pos)          /*!< 0x00002000 */

/*!< ODRV7 configuration */
#define GPIO_ODRVR_ODRV7_Pos                (14U)
#define GPIO_ODRVR_ODRV7_Msk                (0x3U << GPIO_ODRVR_ODRV7_Pos)          /*!< 0x0000C000 */
#define GPIO_ODRVR_ODRV7                    GPIO_ODRVR_ODRV7_Msk                    /*!< ODRV7[1:0] bits (GPIO x drive capability, pin 7) */
#define GPIO_ODRVR_ODRV7_0                  (0x1U << GPIO_ODRVR_ODRV7_Pos)          /*!< 0x00004000 */
#define GPIO_ODRVR_ODRV7_1                  (0x2U << GPIO_ODRVR_ODRV7_Pos)          /*!< 0x00008000 */

/*!< ODRV8 configuration */
#define GPIO_ODRVR_ODRV8_Pos                (16U)
#define GPIO_ODRVR_ODRV8_Msk                (0x3U << GPIO_ODRVR_ODRV8_Pos)          /*!< 0x00030000 */
#define GPIO_ODRVR_ODRV8                    GPIO_ODRVR_ODRV8_Msk                    /*!< ODRV8[1:0] bits (GPIO x drive capability, pin 8) */
#define GPIO_ODRVR_ODRV8_0                  (0x1U << GPIO_ODRVR_ODRV8_Pos)          /*!< 0x00010000 */
#define GPIO_ODRVR_ODRV8_1                  (0x2U << GPIO_ODRVR_ODRV8_Pos)          /*!< 0x00020000 */

/*!< ODRV9 configuration */
#define GPIO_ODRVR_ODRV9_Pos                (18U)
#define GPIO_ODRVR_ODRV9_Msk                (0x3U << GPIO_ODRVR_ODRV9_Pos)          /*!< 0x000C0000 */
#define GPIO_ODRVR_ODRV9                    GPIO_ODRVR_ODRV9_Msk                    /*!< ODRV9[1:0] bits (GPIO x drive capability, pin 9) */
#define GPIO_ODRVR_ODRV9_0                  (0x1U << GPIO_ODRVR_ODRV9_Pos)          /*!< 0x00040000 */
#define GPIO_ODRVR_ODRV9_1                  (0x2U << GPIO_ODRVR_ODRV9_Pos)          /*!< 0x00080000 */

/*!< ODRV10 configuration */
#define GPIO_ODRVR_ODRV10_Pos               (20U)
#define GPIO_ODRVR_ODRV10_Msk               (0x3U << GPIO_ODRVR_ODRV10_Pos)         /*!< 0x00300000 */
#define GPIO_ODRVR_ODRV10                   GPIO_ODRVR_ODRV10_Msk                   /*!< ODRV10[1:0] bits (GPIO x drive capability, pin 10) */
#define GPIO_ODRVR_ODRV10_0                 (0x1U << GPIO_ODRVR_ODRV10_Pos)         /*!< 0x00100000 */
#define GPIO_ODRVR_ODRV10_1                 (0x2U << GPIO_ODRVR_ODRV10_Pos)         /*!< 0x00200000 */

