ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405rx.h
/*!< MUXL3 configuration */
#define GPIO_MUXL_MUXL3_Pos                 (12U)
#define GPIO_MUXL_MUXL3_Msk                 (0xFU << GPIO_MUXL_MUXL3_Pos)           /*!< 0x0000F000 */
#define GPIO_MUXL_MUXL3                     GPIO_MUXL_MUXL3_Msk                     /*!< MUXL3[3:0] bits (Multiplexed function select for GPIO x, pin 3) */
#define GPIO_MUXL_MUXL3_0                   (0x1U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00001000 */
#define GPIO_MUXL_MUXL3_1                   (0x2U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00002000 */
#define GPIO_MUXL_MUXL3_2                   (0x4U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00004000 */
#define GPIO_MUXL_MUXL3_3                   (0x8U << GPIO_MUXL_MUXL3_Pos)           /*!< 0x00008000 */

/*!< MUXL4 configuration */
#define GPIO_MUXL_MUXL4_Pos                 (16U)
#define GPIO_MUXL_MUXL4_Msk                 (0xFU << GPIO_MUXL_MUXL4_Pos)           /*!< 0x000F0000 */
#define GPIO_MUXL_MUXL4                     GPIO_MUXL_MUXL4_Msk                     /*!< MUXL4[3:0] bits (Multiplexed function select for GPIO x, pin 4) */
#define GPIO_MUXL_MUXL4_0                   (0x1U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00010000 */
#define GPIO_MUXL_MUXL4_1                   (0x2U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00020000 */
#define GPIO_MUXL_MUXL4_2                   (0x4U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00040000 */
#define GPIO_MUXL_MUXL4_3                   (0x8U << GPIO_MUXL_MUXL4_Pos)           /*!< 0x00080000 */

/*!< MUXL5 configuration */
#define GPIO_MUXL_MUXL5_Pos                 (20U)
#define GPIO_MUXL_MUXL5_Msk                 (0xFU << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00F00000 */
#define GPIO_MUXL_MUXL5                     GPIO_MUXL_MUXL5_Msk                     /*!< MUXL5[3:0] bits (Multiplexed function select for GPIO x, pin 5) */
#define GPIO_MUXL_MUXL5_0                   (0x1U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00100000 */
#define GPIO_MUXL_MUXL5_1                   (0x2U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00200000 */
#define GPIO_MUXL_MUXL5_2                   (0x4U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00400000 */
#define GPIO_MUXL_MUXL5_3                   (0x8U << GPIO_MUXL_MUXL5_Pos)           /*!< 0x00800000 */

/*!< MUXL6 configuration */
#define GPIO_MUXL_MUXL6_Pos                 (24U)
#define GPIO_MUXL_MUXL6_Msk                 (0xFU << GPIO_MUXL_MUXL6_Pos)           /*!< 0x0F000000 */
#define GPIO_MUXL_MUXL6                     GPIO_MUXL_MUXL6_Msk                     /*!< MUXL6[3:0] bits (Multiplexed function select for GPIO x, pin 6) */
#define GPIO_MUXL_MUXL6_0                   (0x1U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x01000000 */
#define GPIO_MUXL_MUXL6_1                   (0x2U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x02000000 */
#define GPIO_MUXL_MUXL6_2                   (0x4U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x04000000 */
#define GPIO_MUXL_MUXL6_3                   (0x8U << GPIO_MUXL_MUXL6_Pos)           /*!< 0x08000000 */

/*!< MUXL7 configuration */
#define GPIO_MUXL_MUXL7_Pos                 (28U)
#define GPIO_MUXL_MUXL7_Msk                 (0xFU << GPIO_MUXL_MUXL7_Pos)           /*!< 0xF0000000 */
#define GPIO_MUXL_MUXL7                     GPIO_MUXL_MUXL7_Msk                     /*!< MUXL7[3:0] bits (Multiplexed function select for GPIO x, pin 7) */
#define GPIO_MUXL_MUXL7_0                   (0x1U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x10000000 */
#define GPIO_MUXL_MUXL7_1                   (0x2U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x20000000 */
#define GPIO_MUXL_MUXL7_2                   (0x4U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x40000000 */
#define GPIO_MUXL_MUXL7_3                   (0x8U << GPIO_MUXL_MUXL7_Pos)           /*!< 0x80000000 */

/******************  Bit definition for GPIO_MUXH register  *******************/
#define GPIO_MUXH_MUXH_Pos                  (0U)
#define GPIO_MUXH_MUXH_Msk                  (0xFFFFFFFFU << GPIO_MUXH_MUXH_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_MUXH_MUXH                      GPIO_MUXH_MUXH_Msk                      /*!< Multiplexed function select for GPIO x */

/*!< MUXH8 configuration */
#define GPIO_MUXH_MUXH8_Pos                 (0U)
#define GPIO_MUXH_MUXH8_Msk                 (0xFU << GPIO_MUXH_MUXH8_Pos)           /*!< 0x0000000F */
#define GPIO_MUXH_MUXH8                     GPIO_MUXH_MUXH8_Msk                     /*!< MUXH8[3:0] bits (Multiplexed function select for GPIO x, pin 8) */
#define GPIO_MUXH_MUXH8_0                   (0x1U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000001 */
#define GPIO_MUXH_MUXH8_1                   (0x2U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000002 */
#define GPIO_MUXH_MUXH8_2                   (0x4U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000004 */
#define GPIO_MUXH_MUXH8_3                   (0x8U << GPIO_MUXH_MUXH8_Pos)           /*!< 0x00000008 */

/*!< MUXH9 configuration */
#define GPIO_MUXH_MUXH9_Pos                 (4U)
#define GPIO_MUXH_MUXH9_Msk                 (0xFU << GPIO_MUXH_MUXH9_Pos)           /*!< 0x000000F0 */
#define GPIO_MUXH_MUXH9                     GPIO_MUXH_MUXH9_Msk                     /*!< MUXH9[3:0] bits (Multiplexed function select for GPIO x, pin 9) */
#define GPIO_MUXH_MUXH9_0                   (0x1U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000010 */
#define GPIO_MUXH_MUXH9_1                   (0x2U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000020 */
#define GPIO_MUXH_MUXH9_2                   (0x4U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000040 */
#define GPIO_MUXH_MUXH9_3                   (0x8U << GPIO_MUXH_MUXH9_Pos)           /*!< 0x00000080 */

/*!< MUXH10 configuration */
#define GPIO_MUXH_MUXH10_Pos                (8U)
#define GPIO_MUXH_MUXH10_Msk                (0xFU << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000F00 */
#define GPIO_MUXH_MUXH10                    GPIO_MUXH_MUXH10_Msk                    /*!< MUXH10[3:0] bits (Multiplexed function select for GPIO x, pin 10) */
#define GPIO_MUXH_MUXH10_0                  (0x1U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000100 */
#define GPIO_MUXH_MUXH10_1                  (0x2U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000200 */
#define GPIO_MUXH_MUXH10_2                  (0x4U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000400 */
#define GPIO_MUXH_MUXH10_3                  (0x8U << GPIO_MUXH_MUXH10_Pos)          /*!< 0x00000800 */

/*!< MUXH11 configuration */
#define GPIO_MUXH_MUXH11_Pos                (12U)
#define GPIO_MUXH_MUXH11_Msk                (0xFU << GPIO_MUXH_MUXH11_Pos)          /*!< 0x0000F000 */
#define GPIO_MUXH_MUXH11                    GPIO_MUXH_MUXH11_Msk                    /*!< MUXH11[3:0] bits (Multiplexed function select for GPIO x, pin 11) */
#define GPIO_MUXH_MUXH11_0                  (0x1U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00001000 */
#define GPIO_MUXH_MUXH11_1                  (0x2U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00002000 */
#define GPIO_MUXH_MUXH11_2                  (0x4U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00004000 */
#define GPIO_MUXH_MUXH11_3                  (0x8U << GPIO_MUXH_MUXH11_Pos)          /*!< 0x00008000 */

/*!< MUXH12 configuration */
#define GPIO_MUXH_MUXH12_Pos                (16U)
#define GPIO_MUXH_MUXH12_Msk                (0xFU << GPIO_MUXH_MUXH12_Pos)          /*!< 0x000F0000 */
#define GPIO_MUXH_MUXH12                    GPIO_MUXH_MUXH12_Msk                    /*!< MUXH12[3:0] bits (Multiplexed function select for GPIO x, pin 12) */
#define GPIO_MUXH_MUXH12_0                  (0x1U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00010000 */
#define GPIO_MUXH_MUXH12_1                  (0x2U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00020000 */
#define GPIO_MUXH_MUXH12_2                  (0x4U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00040000 */
#define GPIO_MUXH_MUXH12_3                  (0x8U << GPIO_MUXH_MUXH12_Pos)          /*!< 0x00080000 */

/*!< MUXH13 configuration */
#define GPIO_MUXH_MUXH13_Pos                (20U)
#define GPIO_MUXH_MUXH13_Msk                (0xFU << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00F00000 */
#define GPIO_MUXH_MUXH13                    GPIO_MUXH_MUXH13_Msk                    /*!< MUXH13[3:0] bits (Multiplexed function select for GPIO x, pin 13) */
#define GPIO_MUXH_MUXH13_0                  (0x1U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00100000 */
#define GPIO_MUXH_MUXH13_1                  (0x2U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00200000 */
#define GPIO_MUXH_MUXH13_2                  (0x4U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00400000 */
#define GPIO_MUXH_MUXH13_3                  (0x8U << GPIO_MUXH_MUXH13_Pos)          /*!< 0x00800000 */

/*!< MUXH14 configuration */
#define GPIO_MUXH_MUXH14_Pos                (24U)
#define GPIO_MUXH_MUXH14_Msk                (0xFU << GPIO_MUXH_MUXH14_Pos)          /*!< 0x0F000000 */
#define GPIO_MUXH_MUXH14                    GPIO_MUXH_MUXH14_Msk                    /*!< MUXH14[3:0] bits (Multiplexed function select for GPIO x, pin 14) */
#define GPIO_MUXH_MUXH14_0                  (0x1U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x01000000 */
#define GPIO_MUXH_MUXH14_1                  (0x2U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x02000000 */
#define GPIO_MUXH_MUXH14_2                  (0x4U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x04000000 */
#define GPIO_MUXH_MUXH14_3                  (0x8U << GPIO_MUXH_MUXH14_Pos)          /*!< 0x08000000 */

/*!< MUXH15 configuration */
#define GPIO_MUXH_MUXH15_Pos                (28U)
#define GPIO_MUXH_MUXH15_Msk                (0xFU << GPIO_MUXH_MUXH15_Pos)          /*!< 0xF0000000 */
#define GPIO_MUXH_MUXH15                    GPIO_MUXH_MUXH15_Msk                    /*!< MUXH15[3:0] bits (Multiplexed function select for GPIO x, pin 15) */
#define GPIO_MUXH_MUXH15_0                  (0x1U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x10000000 */
#define GPIO_MUXH_MUXH15_1                  (0x2U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x20000000 */
#define GPIO_MUXH_MUXH15_2                  (0x4U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x40000000 */
#define GPIO_MUXH_MUXH15_3                  (0x8U << GPIO_MUXH_MUXH15_Pos)          /*!< 0x80000000 */

/*******************  Bit definition for GPIO_CLR register  *******************/
#define GPIO_CLR_IOCB0_Pos                  (0U)
#define GPIO_CLR_IOCB0_Msk                  (0x1U << GPIO_CLR_IOCB0_Pos)            /*!< 0x00000001 */
#define GPIO_CLR_IOCB0                      GPIO_CLR_IOCB0_Msk                      /*!< GPIO x clear bit, pin 0 */
#define GPIO_CLR_IOCB1_Pos                  (1U)
#define GPIO_CLR_IOCB1_Msk                  (0x1U << GPIO_CLR_IOCB1_Pos)            /*!< 0x00000002 */
#define GPIO_CLR_IOCB1                      GPIO_CLR_IOCB1_Msk                      /*!< GPIO x clear bit, pin 1 */
#define GPIO_CLR_IOCB2_Pos                  (2U)
#define GPIO_CLR_IOCB2_Msk                  (0x1U << GPIO_CLR_IOCB2_Pos)            /*!< 0x00000004 */
#define GPIO_CLR_IOCB2                      GPIO_CLR_IOCB2_Msk                      /*!< GPIO x clear bit, pin 2 */
#define GPIO_CLR_IOCB3_Pos                  (3U)
#define GPIO_CLR_IOCB3_Msk                  (0x1U << GPIO_CLR_IOCB3_Pos)            /*!< 0x00000008 */
#define GPIO_CLR_IOCB3                      GPIO_CLR_IOCB3_Msk                      /*!< GPIO x clear bit, pin 3 */
#define GPIO_CLR_IOCB4_Pos                  (4U)
#define GPIO_CLR_IOCB4_Msk                  (0x1U << GPIO_CLR_IOCB4_Pos)            /*!< 0x00000010 */
#define GPIO_CLR_IOCB4                      GPIO_CLR_IOCB4_Msk                      /*!< GPIO x clear bit, pin 4 */
#define GPIO_CLR_IOCB5_Pos                  (5U)
#define GPIO_CLR_IOCB5_Msk                  (0x1U << GPIO_CLR_IOCB5_Pos)            /*!< 0x00000020 */
#define GPIO_CLR_IOCB5                      GPIO_CLR_IOCB5_Msk                      /*!< GPIO x clear bit, pin 5 */
#define GPIO_CLR_IOCB6_Pos                  (6U)
#define GPIO_CLR_IOCB6_Msk                  (0x1U << GPIO_CLR_IOCB6_Pos)            /*!< 0x00000040 */
#define GPIO_CLR_IOCB6                      GPIO_CLR_IOCB6_Msk                      /*!< GPIO x clear bit, pin 6 */
#define GPIO_CLR_IOCB7_Pos                  (7U)
#define GPIO_CLR_IOCB7_Msk                  (0x1U << GPIO_CLR_IOCB7_Pos)            /*!< 0x00000080 */
#define GPIO_CLR_IOCB7                      GPIO_CLR_IOCB7_Msk                      /*!< GPIO x clear bit, pin 7 */
#define GPIO_CLR_IOCB8_Pos                  (8U)
#define GPIO_CLR_IOCB8_Msk                  (0x1U << GPIO_CLR_IOCB8_Pos)            /*!< 0x00000100 */
#define GPIO_CLR_IOCB8                      GPIO_CLR_IOCB8_Msk                      /*!< GPIO x clear bit, pin 8 */
#define GPIO_CLR_IOCB9_Pos                  (9U)
#define GPIO_CLR_IOCB9_Msk                  (0x1U << GPIO_CLR_IOCB9_Pos)            /*!< 0x00000200 */
#define GPIO_CLR_IOCB9                      GPIO_CLR_IOCB9_Msk                      /*!< GPIO x clear bit, pin 9 */
#define GPIO_CLR_IOCB10_Pos                 (10U)
#define GPIO_CLR_IOCB10_Msk                 (0x1U << GPIO_CLR_IOCB10_Pos)           /*!< 0x00000400 */
#define GPIO_CLR_IOCB10                     GPIO_CLR_IOCB10_Msk                     /*!< GPIO x clear bit, pin 10 */
#define GPIO_CLR_IOCB11_Pos                 (11U)
#define GPIO_CLR_IOCB11_Msk                 (0x1U << GPIO_CLR_IOCB11_Pos)           /*!< 0x00000800 */
#define GPIO_CLR_IOCB11                     GPIO_CLR_IOCB11_Msk                     /*!< GPIO x clear bit, pin 11 */
#define GPIO_CLR_IOCB12_Pos                 (12U)
#define GPIO_CLR_IOCB12_Msk                 (0x1U << GPIO_CLR_IOCB12_Pos)           /*!< 0x00001000 */
#define GPIO_CLR_IOCB12                     GPIO_CLR_IOCB12_Msk                     /*!< GPIO x clear bit, pin 12 */
#define GPIO_CLR_IOCB13_Pos                 (13U)
#define GPIO_CLR_IOCB13_Msk                 (0x1U << GPIO_CLR_IOCB13_Pos)           /*!< 0x00002000 */
#define GPIO_CLR_IOCB13                     GPIO_CLR_IOCB13_Msk                     /*!< GPIO x clear bit, pin 13 */
#define GPIO_CLR_IOCB14_Pos                 (14U)
#define GPIO_CLR_IOCB14_Msk                 (0x1U << GPIO_CLR_IOCB14_Pos)           /*!< 0x00004000 */
#define GPIO_CLR_IOCB14                     GPIO_CLR_IOCB14_Msk                     /*!< GPIO x clear bit, pin 14 */
#define GPIO_CLR_IOCB15_Pos                 (15U)
#define GPIO_CLR_IOCB15_Msk                 (0x1U << GPIO_CLR_IOCB15_Pos)           /*!< 0x00008000 */
#define GPIO_CLR_IOCB15                     GPIO_CLR_IOCB15_Msk                     /*!< GPIO x clear bit, pin 15 */

/******************  Bit definition for GPIO_TOGR register  *******************/
#define GPIO_TOGR_IOTB0_Pos                 (0U)
#define GPIO_TOGR_IOTB0_Msk                 (0x1U << GPIO_TOGR_IOTB0_Pos)           /*!< 0x00000001 */
#define GPIO_TOGR_IOTB0                     GPIO_TOGR_IOTB0_Msk                     /*!< GPIO x toggle bit, pin 0 */
#define GPIO_TOGR_IOTB1_Pos                 (1U)
#define GPIO_TOGR_IOTB1_Msk                 (0x1U << GPIO_TOGR_IOTB1_Pos)           /*!< 0x00000002 */
#define GPIO_TOGR_IOTB1                     GPIO_TOGR_IOTB1_Msk                     /*!< GPIO x toggle bit, pin 1 */
#define GPIO_TOGR_IOTB2_Pos                 (2U)
#define GPIO_TOGR_IOTB2_Msk                 (0x1U << GPIO_TOGR_IOTB2_Pos)           /*!< 0x00000004 */
#define GPIO_TOGR_IOTB2                     GPIO_TOGR_IOTB2_Msk                     /*!< GPIO x toggle bit, pin 2 */
#define GPIO_TOGR_IOTB3_Pos                 (3U)
#define GPIO_TOGR_IOTB3_Msk                 (0x1U << GPIO_TOGR_IOTB3_Pos)           /*!< 0x00000008 */
#define GPIO_TOGR_IOTB3                     GPIO_TOGR_IOTB3_Msk                     /*!< GPIO x toggle bit, pin 3 */
#define GPIO_TOGR_IOTB4_Pos                 (4U)
#define GPIO_TOGR_IOTB4_Msk                 (0x1U << GPIO_TOGR_IOTB4_Pos)           /*!< 0x00000010 */
#define GPIO_TOGR_IOTB4                     GPIO_TOGR_IOTB4_Msk                     /*!< GPIO x toggle bit, pin 4 */
#define GPIO_TOGR_IOTB5_Pos                 (5U)
#define GPIO_TOGR_IOTB5_Msk                 (0x1U << GPIO_TOGR_IOTB5_Pos)           /*!< 0x00000020 */
#define GPIO_TOGR_IOTB5                     GPIO_TOGR_IOTB5_Msk                     /*!< GPIO x toggle bit, pin 5 */
#define GPIO_TOGR_IOTB6_Pos                 (6U)
#define GPIO_TOGR_IOTB6_Msk                 (0x1U << GPIO_TOGR_IOTB6_Pos)           /*!< 0x00000040 */
#define GPIO_TOGR_IOTB6                     GPIO_TOGR_IOTB6_Msk                     /*!< GPIO x toggle bit, pin 6 */
#define GPIO_TOGR_IOTB7_Pos                 (7U)
#define GPIO_TOGR_IOTB7_Msk                 (0x1U << GPIO_TOGR_IOTB7_Pos)           /*!< 0x00000080 */
#define GPIO_TOGR_IOTB7                     GPIO_TOGR_IOTB7_Msk                     /*!< GPIO x toggle bit, pin 7 */
#define GPIO_TOGR_IOTB8_Pos                 (8U)
#define GPIO_TOGR_IOTB8_Msk                 (0x1U << GPIO_TOGR_IOTB8_Pos)           /*!< 0x00000100 */
#define GPIO_TOGR_IOTB8                     GPIO_TOGR_IOTB8_Msk                     /*!< GPIO x toggle bit, pin 8 */
#define GPIO_TOGR_IOTB9_Pos                 (9U)
#define GPIO_TOGR_IOTB9_Msk                 (0x1U << GPIO_TOGR_IOTB9_Pos)           /*!< 0x00000200 */
#define GPIO_TOGR_IOTB9                     GPIO_TOGR_IOTB9_Msk                     /*!< GPIO x toggle bit, pin 9 */
#define GPIO_TOGR_IOTB10_Pos                (10U)
#define GPIO_TOGR_IOTB10_Msk                (0x1U << GPIO_TOGR_IOTB10_Pos)          /*!< 0x00000400 */
#define GPIO_TOGR_IOTB10                    GPIO_TOGR_IOTB10_Msk                    /*!< GPIO x toggle bit, pin 10 */
#define GPIO_TOGR_IOTB11_Pos                (11U)
#define GPIO_TOGR_IOTB11_Msk                (0x1U << GPIO_TOGR_IOTB11_Pos)          /*!< 0x00000800 */
#define GPIO_TOGR_IOTB11                    GPIO_TOGR_IOTB11_Msk                    /*!< GPIO x toggle bit, pin 11 */
#define GPIO_TOGR_IOTB12_Pos                (12U)
#define GPIO_TOGR_IOTB12_Msk                (0x1U << GPIO_TOGR_IOTB12_Pos)          /*!< 0x00001000 */
#define GPIO_TOGR_IOTB12                    GPIO_TOGR_IOTB12_Msk                    /*!< GPIO x toggle bit, pin 12 */
#define GPIO_TOGR_IOTB13_Pos                (13U)
#define GPIO_TOGR_IOTB13_Msk                (0x1U << GPIO_TOGR_IOTB13_Pos)          /*!< 0x00002000 */
#define GPIO_TOGR_IOTB13                    GPIO_TOGR_IOTB13_Msk                    /*!< GPIO x toggle bit, pin 13 */
#define GPIO_TOGR_IOTB14_Pos                (14U)
#define GPIO_TOGR_IOTB14_Msk                (0x1U << GPIO_TOGR_IOTB14_Pos)          /*!< 0x00004000 */
#define GPIO_TOGR_IOTB14                    GPIO_TOGR_IOTB14_Msk                    /*!< GPIO x toggle bit, pin 14 */
#define GPIO_TOGR_IOTB15_Pos                (15U)
#define GPIO_TOGR_IOTB15_Msk                (0x1U << GPIO_TOGR_IOTB15_Pos)          /*!< 0x00008000 */
#define GPIO_TOGR_IOTB15                    GPIO_TOGR_IOTB15_Msk                    /*!< GPIO x toggle bit, pin 15 */

/******************  Bit definition for GPIO_HDRV register  *******************/
#define GPIO_HDRV_HDRV0_Pos                 (0U)
#define GPIO_HDRV_HDRV0_Msk                 (0x1U << GPIO_HDRV_HDRV0_Pos)           /*!< 0x00000001 */
#define GPIO_HDRV_HDRV0                     GPIO_HDRV_HDRV0_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 0 */
#define GPIO_HDRV_HDRV1_Pos                 (1U)
#define GPIO_HDRV_HDRV1_Msk                 (0x1U << GPIO_HDRV_HDRV1_Pos)           /*!< 0x00000002 */
#define GPIO_HDRV_HDRV1                     GPIO_HDRV_HDRV1_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 1 */
#define GPIO_HDRV_HDRV2_Pos                 (2U)
#define GPIO_HDRV_HDRV2_Msk                 (0x1U << GPIO_HDRV_HDRV2_Pos)           /*!< 0x00000004 */
#define GPIO_HDRV_HDRV2                     GPIO_HDRV_HDRV2_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 2 */
#define GPIO_HDRV_HDRV3_Pos                 (3U)
#define GPIO_HDRV_HDRV3_Msk                 (0x1U << GPIO_HDRV_HDRV3_Pos)           /*!< 0x00000008 */
#define GPIO_HDRV_HDRV3                     GPIO_HDRV_HDRV3_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 3 */
#define GPIO_HDRV_HDRV4_Pos                 (4U)
#define GPIO_HDRV_HDRV4_Msk                 (0x1U << GPIO_HDRV_HDRV4_Pos)           /*!< 0x00000010 */
#define GPIO_HDRV_HDRV4                     GPIO_HDRV_HDRV4_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 4 */
#define GPIO_HDRV_HDRV5_Pos                 (5U)
#define GPIO_HDRV_HDRV5_Msk                 (0x1U << GPIO_HDRV_HDRV5_Pos)           /*!< 0x00000020 */
#define GPIO_HDRV_HDRV5                     GPIO_HDRV_HDRV5_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 5 */
#define GPIO_HDRV_HDRV6_Pos                 (6U)
#define GPIO_HDRV_HDRV6_Msk                 (0x1U << GPIO_HDRV_HDRV6_Pos)           /*!< 0x00000040 */
#define GPIO_HDRV_HDRV6                     GPIO_HDRV_HDRV6_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 6 */
#define GPIO_HDRV_HDRV7_Pos                 (7U)
#define GPIO_HDRV_HDRV7_Msk                 (0x1U << GPIO_HDRV_HDRV7_Pos)           /*!< 0x00000080 */
#define GPIO_HDRV_HDRV7                     GPIO_HDRV_HDRV7_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 7 */
#define GPIO_HDRV_HDRV8_Pos                 (8U)
#define GPIO_HDRV_HDRV8_Msk                 (0x1U << GPIO_HDRV_HDRV8_Pos)           /*!< 0x00000100 */
#define GPIO_HDRV_HDRV8                     GPIO_HDRV_HDRV8_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 8 */
#define GPIO_HDRV_HDRV9_Pos                 (9U)
#define GPIO_HDRV_HDRV9_Msk                 (0x1U << GPIO_HDRV_HDRV9_Pos)           /*!< 0x00000200 */
#define GPIO_HDRV_HDRV9                     GPIO_HDRV_HDRV9_Msk                     /*!< GPIO x huge sourcing/sinking strength control, pin 9 */
#define GPIO_HDRV_HDRV10_Pos                (10U)
#define GPIO_HDRV_HDRV10_Msk                (0x1U << GPIO_HDRV_HDRV10_Pos)          /*!< 0x00000400 */
#define GPIO_HDRV_HDRV10                    GPIO_HDRV_HDRV10_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 10 */
#define GPIO_HDRV_HDRV11_Pos                (11U)
#define GPIO_HDRV_HDRV11_Msk                (0x1U << GPIO_HDRV_HDRV11_Pos)          /*!< 0x00000800 */
#define GPIO_HDRV_HDRV11                    GPIO_HDRV_HDRV11_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 11 */
#define GPIO_HDRV_HDRV12_Pos                (12U)
#define GPIO_HDRV_HDRV12_Msk                (0x1U << GPIO_HDRV_HDRV12_Pos)          /*!< 0x00001000 */
#define GPIO_HDRV_HDRV12                    GPIO_HDRV_HDRV12_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 12 */
#define GPIO_HDRV_HDRV13_Pos                (13U)
#define GPIO_HDRV_HDRV13_Msk                (0x1U << GPIO_HDRV_HDRV13_Pos)          /*!< 0x00002000 */
#define GPIO_HDRV_HDRV13                    GPIO_HDRV_HDRV13_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 13 */
#define GPIO_HDRV_HDRV14_Pos                (14U)
#define GPIO_HDRV_HDRV14_Msk                (0x1U << GPIO_HDRV_HDRV14_Pos)          /*!< 0x00004000 */
#define GPIO_HDRV_HDRV14                    GPIO_HDRV_HDRV14_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 14 */
#define GPIO_HDRV_HDRV15_Pos                (15U)
#define GPIO_HDRV_HDRV15_Msk                (0x1U << GPIO_HDRV_HDRV15_Pos)          /*!< 0x00008000 */
#define GPIO_HDRV_HDRV15                    GPIO_HDRV_HDRV15_Msk                    /*!< GPIO x huge sourcing/sinking strength control, pin 15 */

