ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405rx.h
/*!< EXINT11 configuration */
#define SCFG_EXINTC3_EXINT11_Pos            (12U)
#define SCFG_EXINTC3_EXINT11_Msk            (0xFU << SCFG_EXINTC3_EXINT11_Pos)      /*!< 0x0000F000 */
#define SCFG_EXINTC3_EXINT11                SCFG_EXINTC3_EXINT11_Msk                /*!< EXINT11[3:0] bits (EXINT11 input source configuration) */

#define SCFG_EXINTC3_EXINT11_GPA            0x00000000U                             /*!< GPIOA pin 11 */
#define SCFG_EXINTC3_EXINT11_GPB_Pos        (12U)
#define SCFG_EXINTC3_EXINT11_GPB_Msk        (0x1U << SCFG_EXINTC3_EXINT11_GPB_Pos)  /*!< 0x00001000 */
#define SCFG_EXINTC3_EXINT11_GPB            SCFG_EXINTC3_EXINT11_GPB_Msk            /*!< GPIOB pin 11 */
#define SCFG_EXINTC3_EXINT11_GPC_Pos        (13U)
#define SCFG_EXINTC3_EXINT11_GPC_Msk        (0x1U << SCFG_EXINTC3_EXINT11_GPC_Pos)  /*!< 0x00002000 */
#define SCFG_EXINTC3_EXINT11_GPC            SCFG_EXINTC3_EXINT11_GPC_Msk            /*!< GPIOC pin 11 */
#define SCFG_EXINTC3_EXINT11_GPD_Pos        (12U)
#define SCFG_EXINTC3_EXINT11_GPD_Msk        (0x3U << SCFG_EXINTC3_EXINT11_GPD_Pos)  /*!< 0x00003000 */
#define SCFG_EXINTC3_EXINT11_GPD            SCFG_EXINTC3_EXINT11_GPD_Msk            /*!< GPIOD pin 11 */
#define SCFG_EXINTC3_EXINT11_GPF_Pos        (14U)
#define SCFG_EXINTC3_EXINT11_GPF_Msk        (0x1U << SCFG_EXINTC3_EXINT11_GPF_Pos)  /*!< 0x00004000 */
#define SCFG_EXINTC3_EXINT11_GPF            SCFG_EXINTC3_EXINT11_GPF_Msk            /*!< GPIOF pin 11 */

/*****************  Bit definition for SCFG_EXINTC4 register  *****************/
/*!< EXINT12 configuration */
#define SCFG_EXINTC4_EXINT12_Pos            (0U)
#define SCFG_EXINTC4_EXINT12_Msk            (0xFU << SCFG_EXINTC4_EXINT12_Pos)      /*!< 0x0000000F */
#define SCFG_EXINTC4_EXINT12                SCFG_EXINTC4_EXINT12_Msk                /*!< EXINT12[3:0] bits (EXINT12 input source configuration) */

#define SCFG_EXINTC4_EXINT12_GPA            0x00000000U                             /*!< GPIOA pin 12 */
#define SCFG_EXINTC4_EXINT12_GPB_Pos        (0U)
#define SCFG_EXINTC4_EXINT12_GPB_Msk        (0x1U << SCFG_EXINTC4_EXINT12_GPB_Pos)  /*!< 0x00000001 */
#define SCFG_EXINTC4_EXINT12_GPB            SCFG_EXINTC4_EXINT12_GPB_Msk            /*!< GPIOB pin 12 */
#define SCFG_EXINTC4_EXINT12_GPC_Pos        (1U)
#define SCFG_EXINTC4_EXINT12_GPC_Msk        (0x1U << SCFG_EXINTC4_EXINT12_GPC_Pos)  /*!< 0x00000002 */
#define SCFG_EXINTC4_EXINT12_GPC            SCFG_EXINTC4_EXINT12_GPC_Msk            /*!< GPIOC pin 12 */
#define SCFG_EXINTC4_EXINT12_GPD_Pos        (0U)
#define SCFG_EXINTC4_EXINT12_GPD_Msk        (0x3U << SCFG_EXINTC4_EXINT12_GPD_Pos)  /*!< 0x00000003 */
#define SCFG_EXINTC4_EXINT12_GPD            SCFG_EXINTC4_EXINT12_GPD_Msk            /*!< GPIOD pin 12 */
#define SCFG_EXINTC4_EXINT12_GPF_Pos        (2U)
#define SCFG_EXINTC4_EXINT12_GPF_Msk        (0x1U << SCFG_EXINTC4_EXINT12_GPF_Pos)  /*!< 0x00000004 */
#define SCFG_EXINTC4_EXINT12_GPF            SCFG_EXINTC4_EXINT12_GPF_Msk            /*!< GPIOF pin 12 */

/*!< EXINT13 configuration */
#define SCFG_EXINTC4_EXINT13_Pos            (4U)
#define SCFG_EXINTC4_EXINT13_Msk            (0xFU << SCFG_EXINTC4_EXINT13_Pos)      /*!< 0x000000F0 */
#define SCFG_EXINTC4_EXINT13                SCFG_EXINTC4_EXINT13_Msk                /*!< EXINT13[3:0] bits (EXINT13 input source configuration) */

#define SCFG_EXINTC4_EXINT13_GPA            0x00000000U                             /*!< GPIOA pin 13 */
#define SCFG_EXINTC4_EXINT13_GPB_Pos        (4U)
#define SCFG_EXINTC4_EXINT13_GPB_Msk        (0x1U << SCFG_EXINTC4_EXINT13_GPB_Pos)  /*!< 0x00000010 */
#define SCFG_EXINTC4_EXINT13_GPB            SCFG_EXINTC4_EXINT13_GPB_Msk            /*!< GPIOB pin 13 */
#define SCFG_EXINTC4_EXINT13_GPC_Pos        (5U)
#define SCFG_EXINTC4_EXINT13_GPC_Msk        (0x1U << SCFG_EXINTC4_EXINT13_GPC_Pos)  /*!< 0x00000020 */
#define SCFG_EXINTC4_EXINT13_GPC            SCFG_EXINTC4_EXINT13_GPC_Msk            /*!< GPIOC pin 13 */
#define SCFG_EXINTC4_EXINT13_GPD_Pos        (4U)
#define SCFG_EXINTC4_EXINT13_GPD_Msk        (0x3U << SCFG_EXINTC4_EXINT13_GPD_Pos)  /*!< 0x00000030 */
#define SCFG_EXINTC4_EXINT13_GPD            SCFG_EXINTC4_EXINT13_GPD_Msk            /*!< GPIOD pin 13 */
#define SCFG_EXINTC4_EXINT13_GPF_Pos        (6U)
#define SCFG_EXINTC4_EXINT13_GPF_Msk        (0x1U << SCFG_EXINTC4_EXINT13_GPF_Pos)  /*!< 0x00000040 */
#define SCFG_EXINTC4_EXINT13_GPF            SCFG_EXINTC4_EXINT13_GPF_Msk            /*!< GPIOF pin 13 */

/*!< EXINT14 configuration */
#define SCFG_EXINTC4_EXINT14_Pos            (8U)
#define SCFG_EXINTC4_EXINT14_Msk            (0xFU << SCFG_EXINTC4_EXINT14_Pos)      /*!< 0x00000F00 */
#define SCFG_EXINTC4_EXINT14                SCFG_EXINTC4_EXINT14_Msk                /*!< EXINT14[3:0] bits (EXINT14 input source configuration) */

#define SCFG_EXINTC4_EXINT14_GPA            0x00000000U                             /*!< GPIOA pin 14 */
#define SCFG_EXINTC4_EXINT14_GPB_Pos        (8U)
#define SCFG_EXINTC4_EXINT14_GPB_Msk        (0x1U << SCFG_EXINTC4_EXINT14_GPB_Pos)  /*!< 0x00000100 */
#define SCFG_EXINTC4_EXINT14_GPB            SCFG_EXINTC4_EXINT14_GPB_Msk            /*!< GPIOB pin 14 */
#define SCFG_EXINTC4_EXINT14_GPC_Pos        (9U)
#define SCFG_EXINTC4_EXINT14_GPC_Msk        (0x1U << SCFG_EXINTC4_EXINT14_GPC_Pos)  /*!< 0x00000200 */
#define SCFG_EXINTC4_EXINT14_GPC            SCFG_EXINTC4_EXINT14_GPC_Msk            /*!< GPIOC pin 14 */
#define SCFG_EXINTC4_EXINT14_GPD_Pos        (8U)
#define SCFG_EXINTC4_EXINT14_GPD_Msk        (0x3U << SCFG_EXINTC4_EXINT14_GPD_Pos)  /*!< 0x00000300 */
#define SCFG_EXINTC4_EXINT14_GPD            SCFG_EXINTC4_EXINT14_GPD_Msk            /*!< GPIOD pin 14 */
#define SCFG_EXINTC4_EXINT14_GPF_Pos        (10U)
#define SCFG_EXINTC4_EXINT14_GPF_Msk        (0x1U << SCFG_EXINTC4_EXINT14_GPF_Pos)  /*!< 0x00000400 */
#define SCFG_EXINTC4_EXINT14_GPF            SCFG_EXINTC4_EXINT14_GPF_Msk            /*!< GPIOF pin 14 */

/*!< EXINT15 configuration */
#define SCFG_EXINTC4_EXINT15_Pos            (12U)
#define SCFG_EXINTC4_EXINT15_Msk            (0xFU << SCFG_EXINTC4_EXINT15_Pos)      /*!< 0x0000F000 */
#define SCFG_EXINTC4_EXINT15                SCFG_EXINTC4_EXINT15_Msk                /*!< EXINT15[3:0] bits (EXINT15 input source configuration) */

