ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405rx.h
/*!< OPMODE configuration */
#define QSPI_CMD_W3_OPMODE_Pos              (5U)
#define QSPI_CMD_W3_OPMODE_Msk              (0x7U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x000000E0 */
#define QSPI_CMD_W3_OPMODE                  QSPI_CMD_W3_OPMODE_Msk                  /*!< OPMODE[2:0] bits (SPI Operation mode) */
#define QSPI_CMD_W3_OPMODE_0                (0x1U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x00000020 */
#define QSPI_CMD_W3_OPMODE_1                (0x2U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x00000040 */
#define QSPI_CMD_W3_OPMODE_2                (0x4U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x00000080 */

#define QSPI_CMD_W3_OPMODE_SERIAL           0x00000000U                             /*!< Serial mode (1-1-1) */
#define QSPI_CMD_W3_OPMODE_DUAL             0x00000020U                             /*!< Dual-wire mode (1-1-2) */
#define QSPI_CMD_W3_OPMODE_QUAD             0x00000040U                             /*!< Quad mode (1-1-4) */
#define QSPI_CMD_W3_OPMODE_DUALIO           0x00000060U                             /*!< Dual-wire I/O mode (1-2-2) */
#define QSPI_CMD_W3_OPMODE_QUADIO           0x00000080U                             /*!< Quad I/O mode (1-4-4) */
#define QSPI_CMD_W3_OPMODE_DPI              0x000000A0U                             /*!< DPI mode (2-2-2) */
#define QSPI_CMD_W3_OPMODE_QPI              0x000000C0U                             /*!< QPI mode (4-4-4) */

#define QSPI_CMD_W3_PEMOPC_Pos              (16U)
#define QSPI_CMD_W3_PEMOPC_Msk              (0xFFU << QSPI_CMD_W3_PEMOPC_Pos)       /*!< 0x00FF0000 */
#define QSPI_CMD_W3_PEMOPC                  QSPI_CMD_W3_PEMOPC_Msk                  /*!< Performance enhanced mode operation code */
#define QSPI_CMD_W3_INSC_Pos                (24U)
#define QSPI_CMD_W3_INSC_Msk                (0xFFU << QSPI_CMD_W3_INSC_Pos)         /*!< 0xFF000000 */
#define QSPI_CMD_W3_INSC                    QSPI_CMD_W3_INSC_Msk                    /*!< Instruction code */

/******************  Bit definition for QSPI_CTRL register  *******************/
/*!< CLKDIV configuration */
#define QSPI_CTRL_CLKDIV_Pos                (0U)
#define QSPI_CTRL_CLKDIV_Msk                (0x7U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000007 */
#define QSPI_CTRL_CLKDIV                    QSPI_CTRL_CLKDIV_Msk                    /*!< CLKDIV[2:0] bits (Clock divider) */
#define QSPI_CTRL_CLKDIV_0                  (0x1U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000001 */
#define QSPI_CTRL_CLKDIV_1                  (0x2U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000002 */
#define QSPI_CTRL_CLKDIV_2                  (0x4U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000004 */

#define QSPI_CTRL_CLKDIV_DIV2               0x00000000U                             /*!< Clock is divided by 2 */
#define QSPI_CTRL_CLKDIV_DIV4               0x00000001U                             /*!< Clock is divided by 4 */
#define QSPI_CTRL_CLKDIV_DIV6               0x00000002U                             /*!< Clock is divided by 6 */
#define QSPI_CTRL_CLKDIV_DIV8               0x00000003U                             /*!< Clock is divided by 8 */
#define QSPI_CTRL_CLKDIV_DIV3               0x00000004U                             /*!< Clock is divided by 3 */
#define QSPI_CTRL_CLKDIV_DIV5               0x00000005U                             /*!< Clock is divided by 5 */
#define QSPI_CTRL_CLKDIV_DIV10              0x00000006U                             /*!< Clock is divided by 10 */
#define QSPI_CTRL_CLKDIV_DIV12              0x00000007U                             /*!< Clock is divided by 12 */

#define QSPI_CTRL_SCKMODE_Pos               (4U)
#define QSPI_CTRL_SCKMODE_Msk               (0x1U << QSPI_CTRL_SCKMODE_Pos)         /*!< 0x00000010 */
#define QSPI_CTRL_SCKMODE                   QSPI_CTRL_SCKMODE_Msk                   /*!< SCK output mode */
#define QSPI_CTRL_XIPIDLE_Pos               (7U)
#define QSPI_CTRL_XIPIDLE_Msk               (0x1U << QSPI_CTRL_XIPIDLE_Pos)         /*!< 0x00000080 */
#define QSPI_CTRL_XIPIDLE                   QSPI_CTRL_XIPIDLE_Msk                   /*!< XIP port idle status */
#define QSPI_CTRL_ABORT_Pos                 (8U)
#define QSPI_CTRL_ABORT_Msk                 (0x1U << QSPI_CTRL_ABORT_Pos)           /*!< 0x00000100 */
#define QSPI_CTRL_ABORT                     QSPI_CTRL_ABORT_Msk                     /*!< Refresh all commands/FIFOs and reset state machine */

/*!< BUSY configuration */
#define QSPI_CTRL_BUSY_Pos                  (16U)
#define QSPI_CTRL_BUSY_Msk                  (0x7U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00070000 */
#define QSPI_CTRL_BUSY                      QSPI_CTRL_BUSY_Msk                      /*!< BUSY[2:0] bits (Busy bit of SPI status) */
#define QSPI_CTRL_BUSY_0                    (0x1U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00010000 */
#define QSPI_CTRL_BUSY_1                    (0x2U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00020000 */
#define QSPI_CTRL_BUSY_2                    (0x4U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00040000 */

#define QSPI_CTRL_BUSY_BIT0                 0x00000000U                             /*!< Bit 0 */
#define QSPI_CTRL_BUSY_BIT1                 0x00010000U                             /*!< Bit 1 */
#define QSPI_CTRL_BUSY_BIT2                 0x00020000U                             /*!< Bit 2 */
#define QSPI_CTRL_BUSY_BIT3                 0x00030000U                             /*!< Bit 3 */
#define QSPI_CTRL_BUSY_BIT4                 0x00040000U                             /*!< Bit 4 */
#define QSPI_CTRL_BUSY_BIT5                 0x00050000U                             /*!< Bit 5 */
#define QSPI_CTRL_BUSY_BIT6                 0x00060000U                             /*!< Bit 6 */
#define QSPI_CTRL_BUSY_BIT7                 0x00070000U                             /*!< Bit 7 */

#define QSPI_CTRL_XIPRCMDF_Pos              (19U)
#define QSPI_CTRL_XIPRCMDF_Msk              (0x1U << QSPI_CTRL_XIPRCMDF_Pos)        /*!< 0x00080000 */
#define QSPI_CTRL_XIPRCMDF                  QSPI_CTRL_XIPRCMDF_Msk                  /*!< XIP read command flush */
#define QSPI_CTRL_XIPSEL_Pos                (20U)
#define QSPI_CTRL_XIPSEL_Msk                (0x1U << QSPI_CTRL_XIPSEL_Pos)          /*!< 0x00100000 */
#define QSPI_CTRL_XIPSEL                    QSPI_CTRL_XIPSEL_Msk                    /*!< XIP port selection */
#define QSPI_CTRL_KEYEN_Pos                 (21U)
#define QSPI_CTRL_KEYEN_Msk                 (0x1U << QSPI_CTRL_KEYEN_Pos)           /*!< 0x00200000 */
#define QSPI_CTRL_KEYEN                     QSPI_CTRL_KEYEN_Msk                     /*!< SPI data encryption key enable */

